views/repairs/_form.php


    <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data']]); ?>
    <?php
    $type = Type::find()->select(['id','type'])->asArray()->all();
---
SELECT `id`, `type` FROM `type`