views/repairs/_search.php

SELECT `id`, `type` FROM `type`
---
        'action' => ['index'],
        'method' => 'get',
    ]);
    $type = Type::find()->select(['id','type'])->asArray()->all();